Raw-wrk-files/run-1/db/grails/raw
Welcome to Ubuntu 12.04.3 LTS (GNU/Linux 3.9.0-030900-generic x86_64)

 * Documentation:  https://help.ubuntu.com/

  System information as of Tue Oct 15 21:38:54 PDT 2013

  System load:  0.23               Processes:           118
  Usage of /:   5.8% of 129.62GB   Users logged in:     0
  Memory usage: 0%                 IP address for eth1: 172.16.98.98
  Swap usage:   0%

  Graph this data and manage this system at https://landscape.canonical.com/

52 packages can be updated.
19 updates are security updates.


---------------------------------------------------------
 Running Primer grails
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 5 -c 8 -t 8 http://tfbapp:8080/grails/hello/db
---------------------------------------------------------

Running 5s test @ http://tfbapp:8080/grails/hello/db
  8 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.09ms  554.73us   7.05ms   88.03%
    Req/Sec     1.07k   322.15     1.67k    58.26%
  38899 requests in 5.00s, 8.19MB read
Requests/sec:   7779.87
Transfer/sec:      1.64MB

---------------------------------------------------------
 Running Warmup grails
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/grails/hello/db
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/grails/hello/db
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.41ms   37.43ms 550.04ms   92.64%
    Req/Sec     1.88k   364.67     3.41k    70.97%
  222039 requests in 15.00s, 46.75MB read
Requests/sec:  14804.50
Transfer/sec:      3.12MB

---------------------------------------------------------
 Concurrency: 8 for grails
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive'  -d 15 -c 8 -t 8 http://tfbapp:8080/grails/hello/db
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/grails/hello/db
  8 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   787.79us  249.83us   7.20ms   94.00%
    Req/Sec     1.33k   128.54     1.67k    75.42%
  151770 requests in 15.00s, 31.96MB read
Requests/sec:  10117.94
Transfer/sec:      2.13MB

---------------------------------------------------------
 Concurrency: 16 for grails
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive'  -d 15 -c 16 -t 8 http://tfbapp:8080/grails/hello/db
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/grails/hello/db
  8 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.02ms  494.99us  11.34ms   90.14%
    Req/Sec     2.08k   292.69     2.89k    72.77%
  236941 requests in 15.00s, 49.89MB read
Requests/sec:  15796.43
Transfer/sec:      3.33MB

---------------------------------------------------------
 Concurrency: 32 for grails
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive'  -d 15 -c 32 -t 8 http://tfbapp:8080/grails/hello/db
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/grails/hello/db
  8 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.83ms    1.21ms  20.61ms   89.62%
    Req/Sec     2.40k   449.81     4.00k    71.31%
  273242 requests in 15.00s, 57.53MB read
Requests/sec:  18216.81
Transfer/sec:      3.84MB

---------------------------------------------------------
 Concurrency: 64 for grails
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive'  -d 15 -c 64 -t 8 http://tfbapp:8080/grails/hello/db
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/grails/hello/db
  8 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.69ms    2.26ms  30.22ms   88.01%
    Req/Sec     2.36k   414.65     3.67k    76.85%
  270122 requests in 15.00s, 56.88MB read
Requests/sec:  18008.52
Transfer/sec:      3.79MB

---------------------------------------------------------
 Concurrency: 128 for grails
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive'  -d 15 -c 128 -t 8 http://tfbapp:8080/grails/hello/db
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/grails/hello/db
  8 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    86.85ms  282.95ms   1.12s    92.79%
    Req/Sec     1.94k   643.67     3.67k    85.04%
  228609 requests in 15.00s, 48.14MB read
Requests/sec:  15241.79
Transfer/sec:      3.21MB

---------------------------------------------------------
 Concurrency: 256 for grails
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive'  -d 15 -c 256 -t 8 http://tfbapp:8080/grails/hello/db
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/grails/hello/db
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    32.51ms   94.98ms 560.08ms   95.26%
    Req/Sec     1.98k   622.96     5.41k    77.08%
  234513 requests in 15.00s, 49.38MB read
Requests/sec:  15634.37
Transfer/sec:      3.29MB